ХМНПФ_Общее/DataProcessors/уп_РаспределениеИДОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РаспределениеИДОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаФормированияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВГоду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтборТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКРаспределению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НовыеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>15</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ГруппаДоговоров</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РублеДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ФиксПроцент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_РаспределениеИДОПС/Forms/уф_Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМ_ЗаполнитьОбщимПроцентом = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ХМСуммаКРаспределениюПриИзмененииПосле(Элемент)
	ИтогРублеДни =	Объект.НовыеНачисления.Итог("РублеДни");
	Если Не ИтогРублеДни = 0 Тогда
		ХМ_ОбщийПроцент = 100 * Объект.ДнейВГоду * Объект.СуммаКРаспределению / ИтогРублеДни;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("КнопкаПрименитьНаСервере")
Процедура ХМКнопкаПрименитьНаСервере()

	ТабНачислений = Объект.НовыеНачисления.Выгрузить();
#Вставка
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Организация", Объект.Организация);
	ДопПараметры.Вставить("ХМ_ОбщийПроцент", ХМ_ОбщийПроцент);
	ДопПараметры.Вставить("ХМ_ЗаполнитьОбщимПроцентом", ХМ_ЗаполнитьОбщимПроцентом);
	уп_ОбработчикУдаления.ЗаписатьДанныеВДокументыИД(Объект.НовыеНачисления.Выгрузить(),ДопПараметры,Объект.ДнейВГоду
	,Объект.ДатаФормированияДокументов,Объект.ГруппаДоговоров,Объект.ДоговорОПС,Объект.ТипРезерва,Объект.ОтборТипРезерва);
#КонецВставки
#Удаление
	уп_ОбработчикУдаления.ЗаписатьДанныеВДокументыИД(Объект.НовыеНачисления.Выгрузить(),Объект.Организация,Объект.ДнейВГоду
	,Объект.ДатаФормированияДокументов,Объект.ГруппаДоговоров,Объект.ДоговорОПС,Объект.ТипРезерва,Объект.ОтборТипРезерва);
#КонецУдаления

КонецПроцедуры
